STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_Hid/STM32_WPAN/App/app_ble.c
  Add_Advertisment_Service_UUID(DEVICE_INFORMATION_SERVICE_UUID);
  Add_Advertisment_Service_UUID(BATTERY_SERVICE_UUID);
  Add_Advertisment_Service_UUID(HUMAN_INTERFACE_DEVICE_SERVICE_UUID);

  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  Adv_Request(HID_FAST_ADV);

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  uint8_t index;

  event_pckt = (hci_event_pckt*)((hci_uart_pckt *)pckt)->data;

  switch(event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 * disconnection_complete_event;

      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *)event_pckt->data;

      APP_DBG_MSG("HCI_DISCONNECTION_COMPLETE_EVT_CODE for connection handle 0x%x\n",
                  disconnection_complete_event->Connection_Handle);
      /* Find index of the handle deconnected */
      index = 0;
      while((index < CFG_MAX_CONNECTION) &&
          (BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] != disconnection_complete_event->Connection_Handle))
      {
        index++;
      }

      if(index < CFG_MAX_CONNECTION)
      {
        APP_DBG_MSG("Index of the handle deconnected: %d\n", index);
        BleApplicationContext.Device_Connection_Status[index] = HID_IDLE;
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] =
            0xFFFF;
      }
      else
      {
        APP_DBG_MSG("No index found for the handle discconnected !\n");
      }

      /* restart advertising */
      Adv_Request(HID_FAST_ADV);
    }
    break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      meta_evt = (evt_le_meta_event*)event_pckt->data;

      switch(meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 * connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *)meta_evt->data;
          HW_TS_Stop(BleApplicationContext.Connection_mgr_timer_Id);

          APP_DBG_MSG("HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE for connection handle 0x%x\n",
                      connection_complete_event->Connection_Handle);

          /* Find index of a connection not in HID_IDLE, HID_CONNECTED_SERVER or HID_CONNECTED_CLIENT state */
          index = 0;
          while((index < CFG_MAX_CONNECTION) &&
              ((BleApplicationContext.Device_Connection_Status[index] == HID_IDLE) ||
                  (BleApplicationContext.Device_Connection_Status[index] == HID_CONNECTED_SERVER) ||
                  (BleApplicationContext.Device_Connection_Status[index] == HID_CONNECTED_CLIENT)))
          {
            index++;
          }

          if(index < CFG_MAX_CONNECTION)
          {
            APP_DBG_MSG("First index in state %d: %d\n",
                        BleApplicationContext.Device_Connection_Status[index],
                        index);
            if(BleApplicationContext.Device_Connection_Status[index] == HID_LP_CONNECTING)
              /* Connection as client */
              BleApplicationContext.Device_Connection_Status[index] = HID_CONNECTED_CLIENT;
            else
              /* Connection as server */
              BleApplicationContext.Device_Connection_Status[index] = HID_CONNECTED_SERVER;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] = connection_complete_event->Connection_Handle;
          }
          else
          {
            APP_DBG_MSG("No stored connection in state different than HID_IDLE, HID_CONNECTED_CLIENT and HID_CONNECTED_SERVER!\n");
          }
        }
        break; /* HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        default:
          break;
      }
    }
    break; /* HCI_HCI_LE_META_EVT_CODE */

    default:
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}


/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init( void )
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void){

  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *bd_addr;
  uint32_t srd_bd_addr[2];
  uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE };

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  hci_reset();

  /**
   * Write the BD Address
   */

  bd_addr = BleGetBdAddress();
  aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                            CONFIG_DATA_PUBADDR_LEN,
                            (uint8_t*) bd_addr);

  /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
  srd_bd_addr[1] =  0x0000ED6E;
  srd_bd_addr[0] =  LL_FLASH_GetUDN( );
  aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_addr );

  /**
   * Write Identity root key used to derive LTK and CSRK 
   */
    aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)BLE_CFG_IR_VALUE );
    
   /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)BLE_CFG_ER_VALUE );
  
  /**
   * Set TX Power to 0dBm.
   */
  aci_hal_set_tx_power_level(1, CFG_TX_POWER);

  /**
   * Initialize GATT interface
   */
  aci_gatt_init();

  /**
   * Initialize GAP interface
   */
  role = 0;

